tinnfu/CEM5826-M11-MM32L0136C7P/Device/MM32L0130/Include/reg_adc.h
/**
  * @brief ADC_CHANY1 Register Bit Definition
  */
#define  ADC_CHANY1_CHANY_SEL8_Pos                (0)
#define  ADC_CHANY1_CHANY_SEL8_Msk                (0x0FU << ADC_CHANY1_CHANY_SEL8_Pos)              /*!<8th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL9_Pos                (4)
#define  ADC_CHANY1_CHANY_SEL9_Msk                (0x0FU << ADC_CHANY1_CHANY_SEL9_Pos)              /*!<9th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL10_Pos               (8)
#define  ADC_CHANY1_CHANY_SEL10_Msk               (0x0FU << ADC_CHANY1_CHANY_SEL10_Pos)             /*!<10th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL11_Pos               (12)
#define  ADC_CHANY1_CHANY_SEL11_Msk               (0x0FU << ADC_CHANY1_CHANY_SEL11_Pos)             /*!<11th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL12_Pos               (16)
#define  ADC_CHANY1_CHANY_SEL12_Msk               (0x0FU << ADC_CHANY1_CHANY_SEL12_Pos)             /*!<12th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL13_Pos               (20)
#define  ADC_CHANY1_CHANY_SEL13_Msk               (0x0FU << ADC_CHANY1_CHANY_SEL13_Pos)             /*!<13th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL14_Pos               (24)
#define  ADC_CHANY1_CHANY_SEL14_Msk               (0x0FU << ADC_CHANY1_CHANY_SEL14_Pos)             /*!<14th Conversion Select for Any Channel sequence*/
#define  ADC_CHANY1_CHANY_SEL15_Pos               (28)
#define  ADC_CHANY1_CHANY_SEL15_Msk               (0x0FU << ADC_CHANY1_CHANY_SEL15_Pos)             /*!<15th Conversion Select for Any Channel sequence*/

/**
  * @brief ADC_ANY_CFG Register Bit Definition
  */
#define  ADC_ANY_CFG_CHANY_NUM_Pos                (0)
#define  ADC_ANY_CFG_CHANY_NUM_Msk                (0x0FU << ADC_ANY_CFG_CHANY_NUM_Pos)              /*!<Number of Any Channel Mode:*/

/**
  * @brief ADC_ANY_CR Register Bit Definition
  */
#define  ADC_ANY_CR_CHANY_MDEN_Pos                (0)
#define  ADC_ANY_CR_CHANY_MDEN_Msk                (0x01U << ADC_ANY_CR_CHANY_MDEN_Pos)              /*!<Any Channel Mode Enable:*/
#define  ADC_ANY_CR_JCEN_Pos                      (1)
#define  ADC_ANY_CR_JCEN_Msk                      (0x01U << ADC_ANY_CR_JCEN_Pos)                    /*!<Conversion Enable for Injected Channels*/
#define  ADC_ANY_CR_JEOSMPIE_Pos                  (2)
#define  ADC_ANY_CR_JEOSMPIE_Msk                  (0x01U << ADC_ANY_CR_JEOSMPIE_Pos)                /*!<Interrupt Enable for JEOSAMP*/
#define  ADC_ANY_CR_JEOCIE_Pos                    (3)
#define  ADC_ANY_CR_JEOCIE_Msk                    (0x01U << ADC_ANY_CR_JEOCIE_Pos)                  /*!<Interrupt Enable for JEOC*/
#define  ADC_ANY_CR_JEOSIE_Pos                    (4)
#define  ADC_ANY_CR_JEOSIE_Msk                    (0x01U << ADC_ANY_CR_JEOSIE_Pos)                  /*!<Interrupt Enable for JEOS*/
#define  ADC_ANY_CR_JAUTO_Pos                     (5)
#define  ADC_ANY_CR_JAUTO_Msk                     (0x01U << ADC_ANY_CR_JAUTO_Pos)                   /*!<Automatic Injected Conversion*/
#define  ADC_ANY_CR_JADST_Pos                     (6)
#define  ADC_ANY_CR_JADST_Msk                     (0x01U << ADC_ANY_CR_JADST_Pos)                   /*!<ADC Start for Injected Channels:enable JCEN first*/
#define  ADC_ANY_CR_JTRGEN_Pos                    (7)
#define  ADC_ANY_CR_JTRGEN_Msk                    (0x01U << ADC_ANY_CR_JTRGEN_Pos)                  /*!<External Hardware Trigger Enable For Injected Channels*/
#define  ADC_ANY_CR_JTRGSEL_Pos                   (8)
#define  ADC_ANY_CR_JTRGSEL_Msk                   (0x1FU << ADC_ANY_CR_JTRGSEL_Pos)                 /*!<ADC External Trigger Sources Selection For Injected Channel*/
#define  ADC_ANY_CR_JTRGSHIFT_Pos                 (13)
#define  ADC_ANY_CR_JTRGSHIFT_Msk                 (0x07U << ADC_ANY_CR_JTRGSHIFT_Pos)               /*!<External Trigger Shift Sample for Injected ChannelsAfter a trigger signal is generated, the sampling starts after a delay of N PCLK2 clock cycles.In case of trigger scan, the sampling in the rest channels starts immediately after the last sampling is complete.*/
#define  ADC_ANY_CR_JTRG_EDGE_Pos                 (16)
#define  ADC_ANY_CR_JTRG_EDGE_Msk                 (0x03U << ADC_ANY_CR_JTRG_EDGE_Pos)               /*!<External Trigger sources Edge Selection for Injected Channels*/

/**
  * @brief ADC_SMPR1 Register Bit Definition
  */
#define  ADC_SMPR1_SAMP0_Pos                      (0)
#define  ADC_SMPR1_SAMP0_Msk                      (0x0FU << ADC_SMPR1_SAMP0_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP1_Pos                      (4)
#define  ADC_SMPR1_SAMP1_Msk                      (0x0FU << ADC_SMPR1_SAMP1_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP2_Pos                      (8)
#define  ADC_SMPR1_SAMP2_Msk                      (0x0FU << ADC_SMPR1_SAMP2_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP3_Pos                      (12)
#define  ADC_SMPR1_SAMP3_Msk                      (0x0FU << ADC_SMPR1_SAMP3_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP4_Pos                      (16)
#define  ADC_SMPR1_SAMP4_Msk                      (0x0FU << ADC_SMPR1_SAMP4_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP5_Pos                      (20)
#define  ADC_SMPR1_SAMP5_Msk                      (0x0FU << ADC_SMPR1_SAMP5_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP6_Pos                      (24)
#define  ADC_SMPR1_SAMP6_Msk                      (0x0FU << ADC_SMPR1_SAMP6_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP7_Pos                      (28)
#define  ADC_SMPR1_SAMP7_Msk                      (0x0FU << ADC_SMPR1_SAMP7_Pos)                    /*!<Sample Time SelectionThese bits are used to independently select the sample time of each channel. In a sample cycle, the channel selection bit should remain unchanged.*/

/**
  * @brief ADC_SMPR2 Register Bit Definition
  */
#define  ADC_SMPR2_SAMP8_Pos                      (0)
#define  ADC_SMPR2_SAMP8_Msk                      (0x0FU << ADC_SMPR2_SAMP8_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP9_Pos                      (4)
#define  ADC_SMPR2_SAMP9_Msk                      (0x0FU << ADC_SMPR2_SAMP9_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP10_Pos                     (8)
#define  ADC_SMPR2_SAMP10_Msk                     (0x0FU << ADC_SMPR2_SAMP10_Pos)                   /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP11_Pos                     (12)
#define  ADC_SMPR2_SAMP11_Msk                     (0x0FU << ADC_SMPR2_SAMP11_Pos)                   /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP12_Pos                     (16)
#define  ADC_SMPR2_SAMP12_Msk                     (0x0FU << ADC_SMPR2_SAMP12_Pos)                   /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP13_Pos                     (20)
#define  ADC_SMPR2_SAMP13_Msk                     (0x0FU << ADC_SMPR2_SAMP13_Pos)                   /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP14_Pos                     (24)
#define  ADC_SMPR2_SAMP14_Msk                     (0x0FU << ADC_SMPR2_SAMP14_Pos)                   /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP15_Pos                     (28)
#define  ADC_SMPR2_SAMP15_Msk                     (0x0FU << ADC_SMPR2_SAMP15_Pos)                   /*!<Sample Time SelectionThese bits are used to independently select the sample time of each channel. In a sample cycle, the channel selection bit should remain unchanged.*/

/**
  * @brief ADC_JOFR Register Bit Definition
  */
#define  ADC_JOFR_JOFFSET_Pos                     (0)
#define  ADC_JOFR_JOFFSET_Msk                     (0x0FFFU << ADC_JOFR_JOFFSET_Pos)                 /*!<Data Offset Register for 12-bit AD Injected Channel n*/

/**
  * @brief ADC_JSQR Register Bit Definition
  */
#define  ADC_JSQR_JSQ0_Pos                        (0)
#define  ADC_JSQR_JSQ0_Msk                        (0x1FU << ADC_JSQR_JSQ0_Pos)                      /*!<0th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ1_Pos                        (5)
#define  ADC_JSQR_JSQ1_Msk                        (0x1FU << ADC_JSQR_JSQ1_Pos)                      /*!<1th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ2_Pos                        (10)
#define  ADC_JSQR_JSQ2_Msk                        (0x1FU << ADC_JSQR_JSQ2_Pos)                      /*!<2th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ3_Pos                        (15)
#define  ADC_JSQR_JSQ3_Msk                        (0x1FU << ADC_JSQR_JSQ3_Pos)                      /*!<3th Conversion for Injected Sequence*/
#define  ADC_JSQR_JNUM_Pos                        (20)
#define  ADC_JSQR_JNUM_Msk                        (0x03U << ADC_JSQR_JNUM_Pos)                      /*!<Channel Number for Injected Sequence*/

/**
  * @brief ADC_JADDATA Register Bit Definition
  */
#define  ADC_JADDATA_JDATA_Pos                    (0)
#define  ADC_JADDATA_JDATA_Msk                    (0xFFFFU << ADC_JADDATA_JDATA_Pos)                /*!<12-bit A/D conversion result of current injected channel.The alignment style is selected via software.*/
#define  ADC_JADDATA_JCHANNELSEL_Pos              (16)
#define  ADC_JADDATA_JCHANNELSEL_Msk              (0x0FU << ADC_JADDATA_JCHANNELSEL_Pos)            /*!<4 bits show the injected channel corresponding to the current data (Injected Channel Selection)*/
#define  ADC_JADDATA_JOVERRUN_Pos                 (21)
#define  ADC_JADDATA_JOVERRUN_Msk                 (0x01U << ADC_JADDATA_JOVERRUN_Pos)               /*!<Overrun Flag for Injected Channels (read-only)*/
#define  ADC_JADDATA_JVALID_Pos                   (22)
#define  ADC_JADDATA_JVALID_Msk                   (0x01U << ADC_JADDATA_JVALID_Pos)                 /*!<Valid Flag for Injected Channels (read-only)*/

/**
  * @brief ADC_JDR Register Bit Definition
  */
#define  ADC_JDR_JDATA_Pos                        (0)
#define  ADC_JDR_JDATA_Msk                        (0xFFFFU << ADC_JDR_JDATA_Pos)                    /*!<Conversion result of A/D injected channel n The alignment style is selected via software. Please refer to the data alignment section.*/
#define  ADC_JDR_JOVERRUN_Pos                     (21)
#define  ADC_JDR_JOVERRUN_Msk                     (0x01U << ADC_JDR_JOVERRUN_Pos)                   /*!<Overrun Flag for Injected Channels*/
#define  ADC_JDR_JVALID_Pos                       (22)
#define  ADC_JDR_JVALID_Msk                       (0x01U << ADC_JDR_JVALID_Pos)                     /*!<Valid Flag for Injected Channels*/


#endif

